hypnotoad08/sen66-matter-sensor/sdkconfig.defaults_
# ───── 📦 Flash Configuration ─────
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ───── 🧠 PSRAM (Arduino Nano ESP32 has 8MB OPI PSRAM) ─────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ───── UART RCP Connection ─────
CONFIG_OPENTHREAD_RCP=y
CONFIG_OPENTHREAD_RCP_UART=y
CONFIG_OPENTHREAD_UART_PIN_MANUAL=y
CONFIG_OPENTHREAD_HOST_CONNECTION_MODE_UART=y
CONFIG_OPENTHREAD_UART_PORT=1
CONFIG_OPENTHREAD_UART_PIN_TX=43
CONFIG_OPENTHREAD_UART_PIN_RX=44
CONFIG_OPENTHREAD_UART_BAUDRATE=115200
CONFIG_OPENTHREAD_UART_HARDWARE_FLOW_CONTROL=n



# ───── Thread Web UI + Commissioner + Joiner ─────
CONFIG_OPENTHREAD_BR_START_WEB=y
CONFIG_OPENTHREAD_COMMISSIONER=y
CONFIG_OPENTHREAD_JOINER=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# ───── RCP Auto-Update Disabled ─────
# CONFIG_OPENTHREAD_BR_AUTO_UPDATE_RCP is not set

# ───── ⏰ RTC Clock ─────
CONFIG_RTC_CLK_SRC_EXT_CRYS=y

# ───── 🧵 Thread / OpenThread ─────
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# ───── 🌐 IPv6 Support ─────
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y

# ───── 📶 Wi-Fi Config ─────
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# ───── 🔐 Crypto / Matter Requirements ─────
CONFIG_MBEDTLS_HKDF_C=y

# ───── 🧠 Freertos Tick Rate ─────
CONFIG_FREERTOS_HZ=1000

# ───── 🔁 Optional OTA Updates ─────
CONFIG_ENABLE_OTA_REQUESTOR=n

# ───── 🧪 Optional Shell for Serial Debugging ─────
CONFIG_ENABLE_CHIP_SHELL=y

# ───── 🔇 Exclude Unused Clusters to Save Space ─────
CONFIG_SUPPORT_APPLICATION_LAUNCHER_CLUSTER=n
CONFIG_SUPPORT_AUDIO_OUTPUT_CLUSTER=n
CONFIG_SUPPORT_MEDIA_INPUT_CLUSTER=n
CONFIG_SUPPORT_MODE_SELECT_CLUSTER=n
CONFIG_SUPPORT_OCCUPANCY_SENSING_CLUSTER=n
CONFIG_SUPPORT_PM1_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_PM2_5_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_PM10_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_TVOC_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_NITROGEN_DIOXIDE_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_CARBON_DIOXIDE_CONCENTRATION_MEASUREMENT_CLUSTER=n
CONFIG_SUPPORT_USER_LABEL_CLUSTER=n
# ✳️ Enable ones you want (like TVOC, AQI, etc.)

# ───── 🧪 Buttons (only used if you wire one in) ─────
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

#
# mbedTLS
#
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
# end of TLS Key Exchange Methods

CONFIG_MBEDTLS_ECJPAKE_C=y
# end of mbedTLS

